TatanPerez/4201152-Sist-linux-embebidos/Proyecto/Node_Tank/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_LWIP_IP_FORWARD=y
CONFIG_LWIP_IPV4_NAPT=y
CONFIG_ESP_WIFI_REMOTE_AP_SSID="RPi-Hotspot"
CONFIG_ESP_WIFI_REMOTE_AP_PASSWORD="12345678"
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
# Puerto UART para flasheo/monitor (ajusta si usas otro)
CONFIG_ESPTOOLPY_PORT="/dev/ttyUSB0"
